GopalSaraf/Practicals/PSDL/include/proc/pic16f18145.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x09A);
#ifndef _LIB_BUILD
asm("PIE4 equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCO1IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned CLC1IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned CLC3IE                 :1;
        unsigned CLC4IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x09A);
// bitfield macros
#define _PIE4_NCO1IE_POSN                                   0x0
#define _PIE4_NCO1IE_POSITION                               0x0
#define _PIE4_NCO1IE_SIZE                                   0x1
#define _PIE4_NCO1IE_LENGTH                                 0x1
#define _PIE4_NCO1IE_MASK                                   0x1
#define _PIE4_CWG1IE_POSN                                   0x1
#define _PIE4_CWG1IE_POSITION                               0x1
#define _PIE4_CWG1IE_SIZE                                   0x1
#define _PIE4_CWG1IE_LENGTH                                 0x1
#define _PIE4_CWG1IE_MASK                                   0x2
#define _PIE4_CLC1IE_POSN                                   0x2
#define _PIE4_CLC1IE_POSITION                               0x2
#define _PIE4_CLC1IE_SIZE                                   0x1
#define _PIE4_CLC1IE_LENGTH                                 0x1
#define _PIE4_CLC1IE_MASK                                   0x4
#define _PIE4_CLC2IE_POSN                                   0x3
#define _PIE4_CLC2IE_POSITION                               0x3
#define _PIE4_CLC2IE_SIZE                                   0x1
#define _PIE4_CLC2IE_LENGTH                                 0x1
#define _PIE4_CLC2IE_MASK                                   0x8
#define _PIE4_CLC3IE_POSN                                   0x4
#define _PIE4_CLC3IE_POSITION                               0x4
#define _PIE4_CLC3IE_SIZE                                   0x1
#define _PIE4_CLC3IE_LENGTH                                 0x1
#define _PIE4_CLC3IE_MASK                                   0x10
#define _PIE4_CLC4IE_POSN                                   0x5
#define _PIE4_CLC4IE_POSITION                               0x5
#define _PIE4_CLC4IE_SIZE                                   0x1
#define _PIE4_CLC4IE_LENGTH                                 0x1
#define _PIE4_CLC4IE_MASK                                   0x20
#define _PIE4_TX1IE_POSN                                    0x6
#define _PIE4_TX1IE_POSITION                                0x6
#define _PIE4_TX1IE_SIZE                                    0x1
#define _PIE4_TX1IE_LENGTH                                  0x1
#define _PIE4_TX1IE_MASK                                    0x40
#define _PIE4_RC1IE_POSN                                    0x7
#define _PIE4_RC1IE_POSITION                                0x7
#define _PIE4_RC1IE_SIZE                                    0x1
#define _PIE4_RC1IE_LENGTH                                  0x1
#define _PIE4_RC1IE_MASK                                    0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x09B);
#ifndef _LIB_BUILD
asm("PIE5 equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2IE                  :1;
        unsigned RC2IE                  :1;
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned CM1IE                  :1;
        unsigned CM2IE                  :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x09B);
// bitfield macros
#define _PIE5_TX2IE_POSN                                    0x0
#define _PIE5_TX2IE_POSITION                                0x0
#define _PIE5_TX2IE_SIZE                                    0x1
#define _PIE5_TX2IE_LENGTH                                  0x1
#define _PIE5_TX2IE_MASK                                    0x1
#define _PIE5_RC2IE_POSN                                    0x1
#define _PIE5_RC2IE_POSITION                                0x1
#define _PIE5_RC2IE_SIZE                                    0x1
#define _PIE5_RC2IE_LENGTH                                  0x1
#define _PIE5_RC2IE_MASK                                    0x2
#define _PIE5_SSP1IE_POSN                                   0x2
#define _PIE5_SSP1IE_POSITION                               0x2
#define _PIE5_SSP1IE_SIZE                                   0x1
#define _PIE5_SSP1IE_LENGTH                                 0x1
#define _PIE5_SSP1IE_MASK                                   0x4
#define _PIE5_BCL1IE_POSN                                   0x3
#define _PIE5_BCL1IE_POSITION                               0x3
#define _PIE5_BCL1IE_SIZE                                   0x1
#define _PIE5_BCL1IE_LENGTH                                 0x1
#define _PIE5_BCL1IE_MASK                                   0x8
#define _PIE5_SSP2IE_POSN                                   0x4
#define _PIE5_SSP2IE_POSITION                               0x4
#define _PIE5_SSP2IE_SIZE                                   0x1
#define _PIE5_SSP2IE_LENGTH                                 0x1
#define _PIE5_SSP2IE_MASK                                   0x10
#define _PIE5_BCL2IE_POSN                                   0x5
#define _PIE5_BCL2IE_POSITION                               0x5
#define _PIE5_BCL2IE_SIZE                                   0x1
#define _PIE5_BCL2IE_LENGTH                                 0x1
#define _PIE5_BCL2IE_MASK                                   0x20
#define _PIE5_CM1IE_POSN                                    0x6
#define _PIE5_CM1IE_POSITION                                0x6
#define _PIE5_CM1IE_SIZE                                    0x1
#define _PIE5_CM1IE_LENGTH                                  0x1
#define _PIE5_CM1IE_MASK                                    0x40
#define _PIE5_CM2IE_POSN                                    0x7
#define _PIE5_CM2IE_POSITION                                0x7
#define _PIE5_CM2IE_SIZE                                    0x1
#define _PIE5_CM2IE_LENGTH                                  0x1
#define _PIE5_CM2IE_MASK                                    0x80

